<?xml version="1.0" encoding="UTF-8"?>
<configuration_profile>
  <general>
    <name>Lock Screen Message</name>
    <description>Provides a Lock Screen message for devices</description>
    <level>System</level>
    <site>
      <name>None</name>
    </site>
    <category>
      <name>Inventory</name>
    </category>
    <uuid>03E6F56C-ABC5-48A8-8BB2-DB3EE5152D4D</uuid>
    <deployment_method>Install Automatically</deployment_method>
    <redeploy_on_update>Newly Assigned</redeploy_on_update>
    <redeploy_days_before_certificate_expires>0</redeploy_days_before_certificate_expires>
    <payloads>&lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1"&gt;&lt;dict&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;03E6F56C-ABC5-48A8-8BB2-DB3EE5152D4D&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;Configuration&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;Insight - USA&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;03E6F56C-ABC5-48A8-8BB2-DB3EE5152D4D&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;Lock Screen Message&lt;/string&gt;&lt;key&gt;PayloadDescription&lt;/key&gt;&lt;string/&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;key&gt;PayloadEnabled&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadRemovalDisallowed&lt;/key&gt;&lt;true/&gt;&lt;key&gt;PayloadScope&lt;/key&gt;&lt;string&gt;System&lt;/string&gt;&lt;key&gt;PayloadContent&lt;/key&gt;&lt;array&gt;&lt;dict&gt;&lt;key&gt;AssetTagInformation&lt;/key&gt;&lt;string&gt;$SERIALNUBMER&lt;/string&gt;&lt;key&gt;IfLostReturnToMessage&lt;/key&gt;&lt;string&gt;This device belongs to Organization&lt;/string&gt;&lt;key&gt;LockScreenFootnote&lt;/key&gt;&lt;string&gt;This device belongs to Organization&lt;/string&gt;&lt;key&gt;PayloadDisplayName&lt;/key&gt;&lt;string&gt;Lock Screen Message Payload&lt;/string&gt;&lt;key&gt;PayloadIdentifier&lt;/key&gt;&lt;string&gt;CFDF88E1-B94B-482C-B225-66B8CD539595&lt;/string&gt;&lt;key&gt;PayloadOrganization&lt;/key&gt;&lt;string&gt;JAMF Software&lt;/string&gt;&lt;key&gt;PayloadType&lt;/key&gt;&lt;string&gt;com.apple.shareddeviceconfiguration&lt;/string&gt;&lt;key&gt;PayloadUUID&lt;/key&gt;&lt;string&gt;CFDF88E1-B94B-482C-B225-66B8CD539595&lt;/string&gt;&lt;key&gt;PayloadVersion&lt;/key&gt;&lt;integer&gt;1&lt;/integer&gt;&lt;/dict&gt;&lt;/array&gt;&lt;/dict&gt;&lt;/plist&gt;</payloads>
  </general>
  <scope>
    <all_mobile_devices>false</all_mobile_devices>
    <all_jss_users>false</all_jss_users>
    <mobile_devices/>
    <buildings/>
    <departments/>
    <mobile_device_groups/>
    <jss_users/>
    <jss_user_groups/>
    <limitations>
      <users/>
      <user_groups/>
      <network_segments/>
      <ibeacons/>
    </limitations>
    <exclusions>
      <mobile_devices/>
      <buildings/>
      <departments/>
      <mobile_device_groups/>
      <users/>
      <user_groups/>
      <network_segments/>
      <ibeacons/>
      <jss_users/>
      <jss_user_groups/>
    </exclusions>
  </scope>
  <self_service>
    <self_service_description/>
    <security>
      <removal_disallowed>Never</removal_disallowed>
    </security>
    <self_service_icon/>
    <feature_on_main_page>false</feature_on_main_page>
    <self_service_categories>
      <category>
        <name>Inventory</name>
      </category>
    </self_service_categories>
  </self_service>
</configuration_profile>
